Revit 2026 API

# RevitEventArgs Class

---

The class is used as base class for all event argument classes.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitEventArgs Autodesk.Revit.DB.EventsPostEventArgs Autodesk.Revit.DB.EventsPreEventArgs Autodesk.Revit.UI.EventsCommandEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RevitEventArgs : EventArgs
```
```vb
Public Class RevitEventArgs
	Inherits EventArgs
```
```cpp
public ref class RevitEventArgs : public EventArgs
```
```fsharp
type RevitEventArgs =
    class
        inherit EventArgs
    end
```

The RevitEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it. |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace